## Bienvenidos a mi primer acercamiento a Pyton para el analis de Datos

### Primer Ejercicio de Markdown
este es el camino de incio para apreder Pyton para el *analisis de Datos*

### Que voy aprender en este primer curso

1. Cargar Archivos en Jupiter notebook
2. Cargar Librerias 
3. Limpieza de datos
4. Correr algoritmos

[Visita mi perfil Gitgub](https://github.com/db-fer-rodriguez)

![Mis Primeras Palabras](https://learn.microsoft.com/en-us/shows/hello-world/media/helloworld_383x215.png)

### Importar Librerias Pandas Numpy y Matplotlib

In [3]:
import pandas as pd
import numpy as np 
import matplotlib as plt

### Importar archivos Excel o CSV

In [7]:
df_netflix = pd.read_csv("E:\\Users\\xoot\\Downloads\\archive\\netflix_titles.csv")

### Exploracion de Datos CSV

In [8]:
#Mostrar las primeras 5 filas del dataframe
print("Primeras filas del dataframe:")
df_netflix.head()

Primeras filas del dataframe:

,show_id,type,title,director,cast,country,date_added,release_year,rating,duration,listed_in,description
0,s1,Movie,Dick Johnson Is Dead,Kirsten Johnson,NaN,United States,"September 25, 2021",2020,PG-13,90 min,Documentaries,"As her father nears the end of his life, filmm..."
1,s2,TV Show,Blood & Water,NaN,"Ama Qamata, Khosi Ngema, Gail Mabalane, Thaban...",South Africa,"September 24, 2021",2021,TV-MA,2 Seasons,"International TV Shows, TV Dramas, TV Mysteries","After crossing paths at a party, a Cape Town t..."
2,s3,TV Show,Ganglands,Julien Leclercq,"Sami Bouajila, Tracy Gotoas, Samuel Jouy, Nabi...",NaN,"September 24, 2021",2021,TV-MA,1 Season,"Crime TV Shows, International TV Shows, TV Act...",To protect his family from a powerful drug lor...
3,s4,TV Show,Jailbirds New Orleans,NaN,NaN,NaN,"September 24, 2021",2021,TV-MA,1 Season,"Docuseries, Reality TV","Feuds, flirtations and toilet talk go down amo..."
4,s5,TV Show,Kota Factory,NaN,"Mayur More, Jitendra Kumar, Ranjan Raj, Alam K...",India,"September 24, 2021",2021,TV-MA,2 Seasons,"International TV Shows, Romantic TV Shows, TV ...",In a city of coaching centers known to train I...

In [9]:
# Obtener información general del dataframe
print("\nInformación general del dataframe:")
df_netflix.info()

Información general del dataframe:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8807 entries, 0 to 8806
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   show_id       8807 non-null   object
 1   type          8807 non-null   object
 2   title         8807 non-null   object
 3   director      6173 non-null   object
 4   cast          7982 non-null   object
 5   country       7976 non-null   object
 6   date_added    8797 non-null   object
 7   release_year  8807 non-null   int64
 8   rating        8803 non-null   object
 9   duration      8804 non-null   object
 10  listed_in     8807 non-null   object
 11  description   8807 non-null   object
dtypes: int64(1), object(11)
memory usage: 825.8+ KB

In [10]:
# descripción estadística de los datos numéricos
print("\nDescripción estadística:")
df_netflix.describe()

Descripción estadística:

       release_year
count   8807.000000
mean    2014.180198
std        8.819312
min     1925.000000
25%     2013.000000
50%     2017.000000
75%     2019.000000
max     2021.000000

### Manipulacion y Filtrado de Datos

In [12]:
# Seleccionar una columna específica para el análisis
columna_seleccionada = 'release_year'
print(f"\nAnálisis de la columna {columna_seleccionada}:")
print(df_netflix[columna_seleccionada].value_counts())

Análisis de la columna release_year:
release_year
2018    1147
2017    1032
2019    1030
2020     953
2016     902
        ...
1961       1
1925       1
1959       1
1966       1
1947       1
Name: count, Length: 74, dtype: int64

In [13]:
# filtrar shows con contry = United States y release_year = 2005
filtro_show = (df_netflix['country'] == 'United States') & (df_netflix['release_year'] > 2005)

# aplicar el filtro y crear un nuevo dataframe con los resultados
df_netflix_filtrado = df_netflix[filtro_show]

# mostrar resultados
print("Show de estados unidos con fecha de lanzamiento mayor a 2005:")
df_netflix_filtrado

Show de estados unidos con fecha de lanzamiento mayor a 2005:

,show_id,type,title,director,cast,country,date_added,release_year,rating,duration,listed_in,description
0,s1,Movie,Dick Johnson Is Dead,Kirsten Johnson,NaN,United States,"September 25, 2021",2020,PG-13,90 min,Documentaries,"As her father nears the end of his life, filmm..."
9,s10,Movie,The Starling,Theodore Melfi,"Melissa McCarthy, Chris O'Dowd, Kevin Kline, T...",United States,"September 24, 2021",2021,PG-13,104 min,"Comedies, Dramas",A woman adjusting to life after a loss contend...
15,s16,TV Show,Dear White People,NaN,"Logan Browning, Brandon P. Bell, DeRon Horton,...",United States,"September 22, 2021",2021,TV-MA,4 Seasons,"TV Comedies, TV Dramas",Students of color navigate the daily slights a...
27,s28,Movie,Grown Ups,Dennis Dugan,"Adam Sandler, Kevin James, Chris Rock, David S...",United States,"September 20, 2021",2010,PG-13,103 min,Comedies,Mourning the loss of their beloved junior high...
28,s29,Movie,Dark Skies,Scott Stewart,"Keri Russell, Josh Hamilton, J.K. Simmons, Dak...",United States,"September 19, 2021",2013,PG-13,97 min,"Horror Movies, Sci-Fi & Fantasy",A family’s idyllic suburban life shatters when...
...,...,...,...,...,...,...,...,...,...,...,...,...
8790,s8791,Movie,You Don't Mess with the Zohan,Dennis Dugan,"Adam Sandler, John Turturro, Emmanuelle Chriqu...",United States,"September 1, 2019",2008,UR,113 min,"Action & Adventure, Comedies",An Israeli counterterrorism soldier with a sec...
8791,s8792,Movie,Young Adult,Jason Reitman,"Charlize Theron, Patton Oswalt, Patrick Wilson...",United States,"November 20, 2019",2011,R,94 min,"Comedies, Dramas, Independent Movies",When a divorced writer gets a letter from an o...
8802,s8803,Movie,Zodiac,David Fincher,"Mark Ruffalo, Jake Gyllenhaal, Robert Downey J...",United States,"November 20, 2019",2007,R,158 min,"Cult Movies, Dramas, Thrillers","A political cartoonist, a crime reporter and a..."
8804,s8805,Movie,Zombieland,Ruben Fleischer,"Jesse Eisenberg, Woody Harrelson, Emma Stone, ...",United States,"November 1, 2019",2009,R,88 min,"Comedies, Horror Movies",Looking to survive in a world taken over by zo...
8805,s8806,Movie,Zoom,Peter Hewitt,"Tim Allen, Courteney Cox, Chevy Chase, Kate Ma...",United States,"January 11, 2020",2006,PG,88 min,"Children & Family Movies, Comedies","Dragged from civilian life, a former superhero..."

### Tipos de datos Basicos

In [3]:
## 1. Tipos de Datos Básicos:
##   - Enteros (int): Representan números enteros. Ejemplo: `edad = 25`
##   - Flotantes (float): Representan números decimales. Ejemplo: `altura = 1.75`
##   - Cadenas (str): Representan texto. Ejemplo: `nombre = "Juan"`

In [2]:
edad = 25

In [4]:
type(edad)

int

In [5]:
altura = 1.75

In [7]:
type(altura)

float

In [8]:
nombre = "Juan"

In [10]:
type(nombre)

str

### Tipos de datos estructurados

In [11]:
## 2. Tipos de Datos Estructurados:
   ## - **Listas:** Colección ordenada y modificable. Ejemplo: `nombres = ["Juan", "Ana", "Carlos"]`
   ## - **Tuplas:** Colección ordenada e inmutable. Ejemplo: `coordenadas = (10, 20)`
   ## - **Diccionarios:** Colección desordenada de pares clave-valor. Ejemplo: `persona = {"nombre": "Ana", "edad": 30}`

In [12]:
nombres = ["Juan", "Ana", "Carlos"]

In [13]:
nombres[0]

'Juan'

In [14]:
nombres[2]

'Carlos'

In [15]:
cordenadas = (10, 20)

In [16]:
type(cordenadas)

tuple

In [17]:
persona = {"nombre": "Ana", "edad": 30}

In [23]:
import pandas as pd

### Crear un DataFrame a partir de una lista de diccionarios

In [24]:
# Lista de diccionarios con datos de personas
datos_personas = [
                   {"nombre": "Juan", "Edad": 25, "ciudad": "Ciudad A"},
                   {"nombre": "Ana", "Edad": 30, "ciudad": "Ciudad B"},
                   {"nombre": "Carlos", "Edad": 35, "ciudad": "Ciudad A"}
                    ] 
# Crear un DataFrame a partir de la lista de diccionarios
df_personas = pd.DataFrame(datos_personas)

# Mostrar el DataFrame
df_personas

   nombre  Edad    ciudad
0    Juan    25  Ciudad A
1     Ana    30  Ciudad B
2  Carlos    35  Ciudad A

### Tipos de Datos Booleanos:

In [25]:
 ## Bool:** Representa valores de verdad, `True` o `False`. Ejemplo: `es_mayor_edad = True`

In [28]:
ejemplo_boleano = True

In [30]:
type(ejemplo_boleano)

bool

### Librería NumPy para Datos Numéricos:

In [31]:
## Librería NumPy para Datos Numéricos:**
##   - Importar NumPy: `import numpy as np`
##   - Crear un array NumPy: `edades = np.array([25, 30, 35])`
##   - Realizar cálculos matemáticos: `media = np.mean(edades)`

In [1]:
import numpy as np

In [2]:
edades = np.array([25, 30, 35])

In [3]:
media = np.mean(edades)

In [4]:
print(media)

30.0

### Ejercicios prácticos

#### 1er Ejercicio - Listas

In [5]:
## Manipular una lista de nombres, agregar o eliminar elementos:

# Lista de nombres inicial
nombres = ["Juan", "Ana", "Carlos"]

# Agregar un nuevo nombre al final de la lista
nombres.append("Luis")

# Mostrar la lista después de la adición
print("Lista después de agregar un nombre:", nombres)

# Posiciones dentro de una lista, Python en las listas siempre arranca a contar desde 0
#Si quiero seleccionar a Juan deberia utilizar 
nombres[0]

# Eliminar el segundo nombre de la lista
nombres.pop(1)

# Mostrar la lista después de la eliminación
print("Lista después de eliminar el segundo nombre:", nombres)

Lista después de agregar un nombre: ['Juan', 'Ana', 'Carlos', 'Luis']
Lista después de eliminar el segundo nombre: ['Juan', 'Carlos', 'Luis']

#### 2do Ejercicio - Diccionarios

In [7]:
## Utilizar un diccionario para representar información de un estudiante:**

# Datos del estudiante en un diccionario

estudiante = {
    "nombres": "María",
    "edad": 20,
    "cursos": ["Matematicas", "Historia", "Ingles"],
    "promedio": 8.5,
}

## Importar librerias

In [8]:
### Importar librerias
import pandas as pd
import numpy as np
import matplotlib as plt
import matplotlib.pyplot as plt

In [9]:
salaries = pd.read_csv("linkedin-jobs-usa.csv")

In [11]:
salaries.shape

(2845, 9)

In [12]:
salaries.head()

,title,company,description,onsite_remote,salary,location,criteria,posted_date,link
0,Data Analyst - Recent Graduate,PayPal,"At PayPal (NASDAQ: PYPL), we believe that ever...",onsite,NaN,Buffalo-Niagara Falls Area,"[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-22,https://www.linkedin.com/jobs/view/data-analys...
1,Data Analyst - Recent Graduate,PayPal,"At PayPal (NASDAQ: PYPL), we believe that ever...",onsite,NaN,"San Jose, CA","[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-22,https://www.linkedin.com/jobs/view/data-analys...
2,Data Analyst,PayPal,"At PayPal (NASDAQ: PYPL), we believe that ever...",onsite,NaN,"Texas, United States","[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-17,https://www.linkedin.com/jobs/view/data-analys...
3,Data Analyst,PayPal,"At PayPal (NASDAQ: PYPL), we believe that ever...",onsite,NaN,"Illinois, United States","[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-17,https://www.linkedin.com/jobs/view/data-analys...
4,Entry-Level Data Analyst,The Federal Savings Bank,"The Federal Savings Bank, a national bank and ...",onsite,NaN,"Chicago, IL","[{'Seniority level': 'Entry level'}, {'Employm...",2022-11-17,https://www.linkedin.com/jobs/view/entry-level...

In [13]:
salaries.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2845 entries, 0 to 2844
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   title          2845 non-null   object
 1   company        2845 non-null   object
 2   description    2845 non-null   object
 3   onsite_remote  2845 non-null   object
 4   salary         929 non-null    object
 5   location       2845 non-null   object
 6   criteria       2845 non-null   object
 7   posted_date    2845 non-null   object
 8   link           2845 non-null   object
dtypes: object(9)
memory usage: 200.2+ KB

### Tratamiento de duplicados

In [14]:
salaries.drop_duplicates()

,title,company,description,onsite_remote,salary,location,criteria,posted_date,link
0,Data Analyst - Recent Graduate,PayPal,"At PayPal (NASDAQ: PYPL), we believe that ever...",onsite,NaN,Buffalo-Niagara Falls Area,"[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-22,https://www.linkedin.com/jobs/view/data-analys...
1,Data Analyst - Recent Graduate,PayPal,"At PayPal (NASDAQ: PYPL), we believe that ever...",onsite,NaN,"San Jose, CA","[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-22,https://www.linkedin.com/jobs/view/data-analys...
2,Data Analyst,PayPal,"At PayPal (NASDAQ: PYPL), we believe that ever...",onsite,NaN,"Texas, United States","[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-17,https://www.linkedin.com/jobs/view/data-analys...
3,Data Analyst,PayPal,"At PayPal (NASDAQ: PYPL), we believe that ever...",onsite,NaN,"Illinois, United States","[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-17,https://www.linkedin.com/jobs/view/data-analys...
4,Entry-Level Data Analyst,The Federal Savings Bank,"The Federal Savings Bank, a national bank and ...",onsite,NaN,"Chicago, IL","[{'Seniority level': 'Entry level'}, {'Employm...",2022-11-17,https://www.linkedin.com/jobs/view/entry-level...
...,...,...,...,...,...,...,...,...,...
2840,Junior Data Analyst,Iris Software Inc.,"Iris's client, one of the world's largest fina...",hybrid,NaN,"Texas, United States","[{'Seniority level': 'Mid-Senior level'}, {'Em...",2022-10-21,https://www.linkedin.com/jobs/view/junior-data...
2841,Data Analyst (SQL),Marwood Group,The Marwood Group (Marwood) is a leading healt...,hybrid,"$75,000.00\r\n -\r\n $95...",New York City Metropolitan Area,"[{'Seniority level': 'Mid-Senior level'}, {'Em...",2022-10-26,https://www.linkedin.com/jobs/view/data-analys...
2842,Data Analyst,SmartSense by Digi,"Join a high-performing, tight-knit team at a f...",hybrid,NaN,"Mishawaka, IN","[{'Seniority level': 'Associate'}, {'Employmen...",2022-11-17,https://www.linkedin.com/jobs/view/data-analys...
2843,Data Analyst,Synergy Search,Nashville (Berry Hill) based company looking t...,hybrid,"$85,000.00\r\n -\r\n $95...",Nashville Metropolitan Area,"[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-14,https://www.linkedin.com/jobs/view/data-analys...
2844,Data Analyst,Insight Global,Overview - Minimum 5 years in a quantitative d...,hybrid,"$130,000.00\r\n -\r\n $1...","Burbank, CA","[{'Seniority level': 'Mid-Senior level'}, {'Em...",2022-11-14,https://www.linkedin.com/jobs/view/data-analys...

### Tratamiento de Valores Nulos

#### 1era Opción: Eliminar todos los valores nulos

In [17]:
# Eliminar filas que contienen al menos un valor nulo
df_sin_nulos = salaries.dropna()

# Eliminar columnas que contienen al menos un valor nulo
df_sin_nulos_columnas = salaries.dropna(axis=1)

In [ ]:
df_sin_nulos.shapeimport pandas as pd
import numpy as np

# Crear un DataFrame de ejemplo
data = {
    'A': [1, 2, np.nan, 4],
    'B': [np.nan, 2, 3, 4],
    'C': [1, 2, 3, np.nan]
}
df = pd.DataFrame(data)

# Eliminar filas con cualquier valor nulo
df_sin_nulos = df.dropna()
print(df_sin_nulos)

(929, 9)

In [20]:
# Eliminar columnas que contienen al menos un valor nulo
df_sin_nulos_columnas = salaries.dropna(axis=1)

In [21]:
df_sin_nulos_columnas.shape

(2845, 8)

### Transformación de datos
#### 2da Opción: Reemplazar NaNs por la media
##### Parsing ("Parseo") de la columna Salary

In [22]:
df_sin_nulos['salary']

8       $100,000.00\r\n            -\r\n            $1...
24      $50,000.00\r\n            -\r\n            $55...
35      $100,000.00\r\n            -\r\n            $1...
61      $100,000.00\r\n            -\r\n            $1...
88      $100,000.00\r\n            -\r\n            $1...
                              ...
2834        $30.00\r\n            -\r\n            $33.00
2836    $120,000.00\r\n            -\r\n            $1...
2841    $75,000.00\r\n            -\r\n            $95...
2843    $85,000.00\r\n            -\r\n            $95...
2844    $130,000.00\r\n            -\r\n            $1...
Name: salary, Length: 929, dtype: object

In [ ]:
## Este código toma una columna `'salary'` que contiene valores de salario en formato de cadena,
## elimina cualquier caracter no numérico, extrae los dígitos y convierte la columna resultante en valores numéricos de tipo float.
## El resultado se almacena en una nueva columna llamada `'salary_numeric'`.
## Esto es útil cuando la columna `'salary'` inicial contiene caracteres no numéricos y se desea trabajar con los salarios como valores numéricos.
df_sin_nulos["salary_numeric"] = (
    df_sin_nulos["salary"]
    .replace("[^\d.]", "", regex=True)
    .str.extract("(\d+)")
    .astype(float)
)